# Bereinigung der einzelnen Datensätze

## Zusammenführung der Datensätze

In [50]:
import pandas as pd
import numpy as np

df_besucher = pd.read_csv('data/besucher.csv', decimal = '.', sep = ";")   
df_kunden = pd.read_csv('data/kunden.csv', decimal = '.', sep = ";")
df_geo = pd.read_csv('data/geo.txt', decimal = '.', delimiter = "\t")

In [51]:
df_geo

     KundeNr          Niederlassung
0      K0001                Sachsen
1      K0002                    NRW
2      K0003                 Hessen
3      K0004                 Bayern
4      K0005                 Bayern
...      ...                    ...
1990   K1991                 Hessen
1991   K1992      Baden-Württemberg
1992   K1993    Nordrhein-Westfalen
1993   K1994                 Berlin
1994   K1995  Berlin-Charlottenburg

[1995 rows x 2 columns]

In [21]:
df_kunden.isnull().sum()

Alter         0
Einkommen     0
Preis         0
Geschlecht    5
Zeit          0
KundeNr       0
dtype: int64

In [18]:
df_besucher.isnull().sum()
# df_besucher.dtypes

Alter         0
Einkommen     0
Geschlecht    0
Zeit          0
KundeNr       0
dtype: int64

### Zusammenführung von besucher.csv und kunden.csv

In [64]:
df_alle_ohneGEO = pd.concat([df_besucher,df_kunden], ignore_index=True,)
df_alle_ohneGEO_sortiert = df_alle_ohneGEO.sort_values(by=['KundeNr'],ascending=True)

df_alle_ohneGEO_sortiert

      Alter          Einkommen  Geschlecht  Zeit KundeNr      Preis
1367     68            89437.0         1.0  62.0   K0001  114481.90
1783     58            65271.0         1.0  44.0   K0002  106258.99
1116     44            48195.0         1.0  29.0   K0003   85705.57
1065     37            48957.0         0.0  36.0   K0004   76412.36
1882     50            56621.0         0.0  40.0   K0005   92898.67
...     ...                ...         ...   ...     ...        ...
18       48  59967,31328247114         1.0  21,0   K1991        NaN
799      67  81521,76144297997         1.0  21,0   K1992        NaN
592      40  41616,57298010873         0.0  48,0   K1993        NaN
72       49   76602,7888395788         1.0  19,0   K1994        NaN
491      49  54754,52544962578         1.0  44,0   K1995        NaN

[1995 rows x 6 columns]

### Zusammenführung von geo.txt und df_alle_ohneGEO

In [70]:
df_final= pd.merge(df_alle_ohneGEO_sortiert,df_geo,on='KundeNr', how='outer')
df_final

,Alter,Einkommen,Geschlecht,Zeit,KundeNr,Preis,Niederlassung
0,68,89437.0,1.0,62.0,K0001,114481.90,Sachsen
1,58,65271.0,1.0,44.0,K0002,106258.99,NRW
2,44,48195.0,1.0,29.0,K0003,85705.57,Hessen
3,37,48957.0,0.0,36.0,K0004,76412.36,Bayern
4,50,56621.0,0.0,40.0,K0005,92898.67,Bayern
...,...,...,...,...,...,...,...
1990,48,"59967,31328247114",1.0,"21,0",K1991,NaN,Hessen
1991,67,"81521,76144297997",1.0,"21,0",K1992,NaN,Baden-Württemberg
1992,40,"41616,57298010873",0.0,"48,0",K1993,NaN,Nordrhein-Westfalen
1993,49,"76602,7888395788",1.0,"19,0",K1994,NaN,Berlin
1994,49,"54754,52544962578",1.0,"44,0",K1995,NaN,Berlin-Charlottenburg